# 3 Importing libraries and datasets

In [2]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [4]:
# Import dataframes
path= r"C:\Users\sosia\12-2024 Instacart Basket Analysis"

In [6]:
customers = pd.read_csv(r'C:\Users\sosia\12-2024 Instacart Basket Analysis\02 Data\Original Data\customers\customers.csv')

# 4 Wrangle data

In [10]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
customers.rename(columns={
    'First Name': 'first_name',
    'Surnam': 'last_name',  # Correcting potential typo "Surnam" to "last_name"
    'STATE': 'state',
    'Age': 'age',
    'date_joined': 'signup_date',
    'n_dependants': 'num_dependents',
    'fam_status': 'family_status',
}, inplace=True)

In [16]:
customers.head()

,user_id,first_name,last_name,Gender,state,age,signup_date,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# data quality and consistency checks

In [26]:
# Check for Missing Values
missing_values = customers.isnull().sum()

In [28]:
print("Missing Values:\n", missing_values)

Missing Values:
 user_id               0
first_name        11259
last_name             0
Gender                0
state                 0
age                   0
signup_date           0
num_dependents        0
family_status         0
income                0
dtype: int64

In [30]:
# Handling missing values (Example: Fill missing last names with 'Unknown')
customers['first_name'].fillna('Unknown', inplace=True)

C:\Users\sosia\AppData\Local\Temp\ipykernel_61944\437434242.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers['first_name'].fillna('Unknown', inplace=True)

In [32]:
# Check for Duplicates
duplicates = customers.duplicated().sum()

In [34]:
print("Number of Duplicates:", duplicates)

Number of Duplicates: 0

In [42]:
customers.head()

,user_id,first_name,last_name,Gender,state,age,signup_date,num_dependents,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

In [40]:
# Convert Data Types (Fix Mixed-Type Columns)
# Convert 'signup_date' to datetime
customers['signup_date'] = pd.to_datetime(customers['signup_date'])

In [50]:
# Convert 'age', 'num_dependents', and 'annual_income' to numeric types (ensure no text data)
customers['age'] = pd.to_numeric(customers['age'])

In [52]:
customers['num_dependents'] = pd.to_numeric(customers['num_dependents'])

In [54]:
customers['income'] = pd.to_numeric(customers['income'])

In [56]:
### 4. Validate Categorical Values
# Check unique values in categorical columns to spot inconsistencies
print("Unique Values in 'gender':", customers['Gender'].unique())

Unique Values in 'gender': ['Female' 'Male']

In [58]:
print("Unique Values in 'family_status':", customers['family_status'].unique())

Unique Values in 'family_status': ['married' 'single' 'living with parents and siblings' 'divorced/widowed']

In [60]:
customers.info

<bound method DataFrame.info of         user_id first_name last_name  Gender           state  age signup_date  \
0         26711    Deborah  Esquivel  Female        Missouri   48  2017-01-01
1         33890   Patricia      Hart  Female      New Mexico   36  2017-01-01
2         65803    Kenneth    Farley    Male           Idaho   35  2017-01-01
3        125935   Michelle     Hicks  Female            Iowa   40  2017-01-01
4        130797        Ann   Gilmore  Female        Maryland   26  2017-01-01
...         ...        ...       ...     ...             ...  ...         ...
206204   168073       Lisa      Case  Female  North Carolina   44  2020-04-01
206205    49635     Jeremy   Robbins    Male          Hawaii   62  2020-04-01
206206   135902      Doris  Richmond  Female        Missouri   66  2020-04-01
206207    81095       Rose   Rollins  Female      California   27  2020-04-01
206208    80148    Cynthia     Noble  Female        New York   55  2020-04-01

        num_dependents family_status  income
0                    3       married  165665
1                    0        single   59285
2                    2       married   99568
3                    0        single   42049
4                    1       married   40374
...                ...           ...     ...
206204               1       married  148828
206205               3       married  168639
206206               2       married   53374
206207               1       married   99799
206208               1       married   57095

[206209 rows x 10 columns]>

In [68]:
print(customers.dtypes)

user_id                    int64
first_name                object
last_name                 object
Gender                    object
state                     object
age                        int64
signup_date       datetime64[ns]
num_dependents             int64
family_status             object
income                     int64
dtype: object

In [72]:
# Export as pkl
customers.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_cleaned.pkl'))